OSCCAR/tutorials/heatTransfer/buoyantBoussinesqPimpleFoam/verticalHotPlate/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    hotWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          4000;
        startFace       221530;
    }
    sides
    {
        type            patch;
        nFaces          7040;
        startFace       225530;
    }
    inlet
    {
        type            patch;
        nFaces          950;
        startFace       232570;
    }
    outlet
    {
        type            patch;
        nFaces          950;
        startFace       233520;
    }
)

// ************************************************************************* //
