OSCCAR/tutorials/heatTransfer/buoyantBoussinesqPimpleFoam/verticalHotPlate/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0.1);

boundaryField
{
    atmosphere
    {
        //type            inletOutlet;
        //inletValue      uniform (0 0 0);
        //value           uniform (0 0 0);
        //
        // type            fixedValue;
        // value           uniform (0 0 0);
        //
        type            pressureInletOutletVelocity;
        // phi             phi;
        // tangentialVelocity uniform (0 0 0);
        value           uniform (0 0 0);
    }
    
    inlet
    {
        // type           fixedValue;
        // value          uniform (0 0 0);
        //
        $atmosphere;
    }
    
    outlet
    {
        $atmosphere;
    }
    
    
    sides
    {
        $atmosphere;
    }
    
    hotWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
