OSCCAR/tutorials/heatTransfer/buoyantBoussinesqPimpleFoam/verticalHotPlate/0.org/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// dimensions      [1 -1 -2 0 0 0 0]; // Compressible
dimensions      [0 2 -2 0 0 0 0]; // Incompressible

internalField   uniform 1e5;

boundaryField
{
    "(inlet|outlet|sides)"
    {
        type            calculated;
        value           $internalField;
    }
    
    hotWall
    {
        type            calculated;
        value           $internalField;
    }
}


// ************************************************************************* //
