OSCCAR/tutorials/heatTransfer/buoyantBoussinesqPimpleFoam/verticalHotPlate/0.org/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    "(inlet|outlet|sides)"
    {
        type            zeroGradient;
        value           uniform 0;
    }
    hotWall
    {
        // type            nutkWallFunction; // kEpsilon
        type            nutUSpaldingWallFunction; // SpalartAllmaras
        value           uniform 0;
    }
}


// ************************************************************************* //
